perf/proxy-9091/node-scaled/load/load.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Linear-1
      duration: 30
      arrivalRate: 5
      rampTo: 100
    - name: Stop-1
      duration: 15
      arrivalRate: 100
    - name: Linear-2
      duration: 30
      arrivalRate: 100
      rampTo: 200
    - name: Stop-2
      duration: 15
      arrivalRate: 200
    - name: Linear-3
      duration: 30
      arrivalRate: 200
      rampTo: 300
    - name: Stop-3
      duration: 15
      arrivalRate: 300
    - name: Linear-4
      duration: 30
      arrivalRate: 300
      rampTo: 400
    - name: Stop-4
      duration: 15
      arrivalRate: 400
    - name: down
      duration: 30
      arrivalRate: 5

scenarios:      
  - name: Bbox2 (/)
    flow:
      - get:
          url: '/proxy-9091'